[
    "Cisgender-male or female",
    "Transgender-person whose gender s the opposite as the one they were assigned with",
    "Bigender-person who identifies as both male and female",
    "Agender-person who doesn't sexually identify as any gender at all",
    "Genderfluid-person whose gender changes fluidly between binary and non binary genders",
    "Pronouns-people will usuall prefer (or not) to be referred with specific pronouns according to their gender, although some don't have any preferences. The most common pronouns are __he/him__, __she/her__ and __they/them__ (as for non-binary)",
    "Non-binary-umbrella term for genders that are not binary (aka exclusively male or female)",
    "Polygender-the feeling of having more than one simultaneous or fluctuating gender; simultaneous with multigenderand omnigender",
    "Pangender-the feeling of having every gender; this is considered problematic by some communities and thus has been used as the concept of relating in some way to all genders as opposed to containing every gender identity; only applies to genders within one’s own culture",
    "Neutrois-when you identify as agender, neither male nor female, and/or genderless",
    "Androgyne-this term overlaps a lot between gender identification and presentation. It can be used to describe others and as an identification. This term is used to describe people who are neither male nor female or are both male and female. Basically anyone who does not fit into a binary gender category",
    "Intergender-somebody who's gender is somewhere between male and female",
    "Transsexual-transgender person who got surgery in order to have the other sex's genitals",
    "Xoy-Someone who identifies in some was as a nonbinary boy or nonbinary boy-adjacent. Someone who identifies with some part of man/boyhood but who wants a more nonbinary and neutral sounding word because they aren’t entirely boys or don’t want to be associated with the typical ideas brought up by the word “boy.“",
    "Girlflux-a gender identity in which a person can feel mostly or completely female most of the time but experiences varying degrees of female identity, despite their biological sex. For example, one could feel 0% (agender), 50% (demigirl), 100% (female), or anything in between like paragirl and librafeminine. The intensity can fluctuate over any period of time",
    "Dyadic-a word used to refer to people who are not intersex",
    "Multiflux-is an umbrella term that represents all fluctuating genders under the subcategory of genderflux that can contain multiple genders. This term is similar in meaning to the umbrella term multigender, but multiflux represents genders relating to genderflux and in some way fluctuate",
    "Gender identity-a person's private sense of their own gender, which is separate from sexual/romantic orientation or appearence. Because gender identity is an internal experience, it cannot be assigned, diagnosed, measured or disproved by anyone else—a person's gender identity is their own",
    "Genderliminal-a gender on the edge of existing and not existing (between gender and agender), or one that dances between the two. There are two variables, __boyliminal__ and __girlliminal__",
    "Achillean-An umbrella term for male aligned people, who are romantically and/or sexually attracted to male aligned people",
    "Lamingender-a polygender identity that feels layered, or as if it is composed of distinct slices",
    "Libragender-A gender identity that is mostly agender, but has a connection to masculinity and/or femininity and/or other gendered feelings. That connection may be static (libragender, librafeminine, libramasculine, etc) or fluid, where one feels that the gender one experiences changes (librafluid). Based on the zodiac sign Libra",
    "Lunarian-having similarities in identity or experience with women. It functions as a less easily abused term for “female aligned“",
    "Macrogender-large feelings of gender that are not identifiable within social gender categories",
    "Magifluid-feeling mostly one gender, but the other(s) being fluid",
    "Magigender-feeling mostly one gender, with the rest being something else. The “something else” may or may not be known"
]
