[
    "**Gay:** male attracted to male people",
    "**Lesbian:** female attacted to female people",
    "**Heterosexual/straight:** male attracted to females or female attracted to males",
    "**Bisexual:** person who likes both male and female people",
    "**Pansexual:** attracted to everyone, regardless of their gender",
    "**Asexual:** not sexually attracted to anyone",
    "**Gynsexual:** attracted to females and femimine males",
    "**Novosexual:** means that your sexuality and your gender can change fluidly as in genderfluidity",
    "**Demisexual:** a demisexual person is only attracted sexually by people whom they have a strong friendship relationship",
    "**Sapiosexual:** attracted to intelligent people, despite their gender and how beautiful they look",
    "**Cryptosexual:** attracted to mythological creatures",
    "**Polysexual:** similar to pansexual, but only attracted to a certain group of both non binary and binary genders",
    "**Monosexual:** being attracted to only one gender",
    "**Allosexual:** When you are not asexual (attracted to at least one gender)",
    "**Bicurious:** people who are open to experiment with genders that are not only their own, but do not know if they are open to forming any sort of relationship with multiple genders.",
    "**Omnisexual:** a sexuality which refers to an individual who identifies as a person who is attracted to all known genders, but is not \"gender blind\" and can have preference",
    "**Nowosexuality** a sexual orientation where the individual can feel sexual attraction towards any gender other than female.",
    "**Abrosexual:** a term that refers to an individual who is sexually fluid/has a fluid and/or rapidly changing sexuality that fluctuates between many different sexual orientations",
    "**-romantic sexualities:** these refer to the romantic attraction towards others, without counting sexual desires, such as biromantic, panromantic, aromantic...",
    "**Aegosexual or Autochorissexual:** A disconnection between oneself and the object of sexual attraction; may involve fantasies in response to display of attraction, but lacking any desire to be a participant in the activities there in.",
    "**Lithsexual:** Experiencing sexual attraction, but having no desire to have interactions or have feelings reciprocated -or- experiencing a particular kind of attraction, which fades if it is reciprocated or if one enters a relationship with the person one is attracted to.",
    "**Amorplatonic:** Experiencing romantic attraction but only wanting to be in queerplatonic/quasiplatonic relationships",
    "**Amosexual or Aroamosexual or Aroamant:** Only feeling romantic attraction during the act of sex.",
    "**Bifluxsexual:** Experiencing attraction to two or more genders but shifting in one genders one is attracted to over time",
    "**Caligosexual:** feeling sexual attraction that is very weak or vague, almost nonexistent, like a vapor, fog, or mist.",
    "**Cupiosexual:** Desiring a relationship but not feeling sexual attraction towards anyone in particular.",
    "**Dwinsexual:** Experiencing sexual attraction for most of their life, but after a particularly strong/close moment/relationship of sexual attraction, they soon or immediately stop experiencing that attraction afterwards, or that attraction slowly dwindles away.",
    "**(missing name):** Being nonbinary and attracted (excusively or not) to nonbinary individuals",
    "**Finsexual:** Experiencing sexual attraction towards people feminine in nature."
]